Revit 2025 API
ParameterTypeId.RebarHookRotationAtEnd Property
 "Hook Rotation At End"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static ForgeTypeId RebarHookRotationAtEnd { get; }
Public Shared ReadOnly Property RebarHookRotationAtEnd As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarHookRotationAtEnd {
	ForgeTypeId^ get ();
}
static member RebarHookRotationAtEnd : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace